{"meta":{"title":"Syncfusion released Beta version of WinRT controls","excerpt":"\t\t\tSyncfusion now come up with a pack of WinRT XAML controls, which includes high performance chart, maps, diagram, radial menu, etc. It also includes a unique set of controls for reading and writing Excel, Word, and PDF documents in Windows store apps. The studio for WinRT can be downloaded from th","tags":[],"featuredImage":"https://s0.wp.com/i/blank.jpg","published_date":"2012-10-27T00:00:00.000Z","postId":"syncfusion-released-beta-version-of-winrt-controls"},"content":"\n\t\t\t\t<p>Syncfusion now come up with a pack of WinRT XAML controls, which includes high performance chart, maps, diagram, radial menu, etc. It also includes a unique set of controls for reading and writing Excel, Word, and PDF documents in Windows store apps. The studio for WinRT can be downloaded from the below location.</p>\n<p><a href=\"http://www.syncfusion.com/products/winrt\">http://www.syncfusion.com/products/winrt</a></p>\n<p><span id=\"more-19\"></span></p>\n<h2>Chart</h2>\n<p>Essential Chart for WinRT is a high-performance charting component that is very easy to use and is also visually stunning. It includes the most common chart types ranging from line charts to specialized financial charts. It also utilizes DirectX rendering to deliver the best possible performance.</p>\n<p>\n</p><h2>Diagram</h2>\n<p>Essential Diagram for WinRT can be used to create and present feature-rich diagrams within your Windows store applications. It is commonly used to compose diagrams and workflows either visually using touch interactions or by automatically laying out the elements following specific rules.&#x201D;</p>\n<p>\n</p><h2>Maps</h2>\n<p>Essential Map for WinRT is a powerful data visualization control that can be used to easily visualize data on a map surface. It is frequently used on financial dashboards for plotting sales data on a map.</p>\n<p>\n</p><h2>Gauge</h2>\n<p>Essential Gauge for WinRT is a highly customizable gauge control that is used to visualize the given value over a circular scale. All the elements including scales, ticks, pointers and labels can be customized as required.</p>\n<p>\n</p><h2>Radial Menu</h2>\n<p>The radial menu control displays a hierarchical menu structure in a radial layout optimized for usage on touch devices. It is typically used as a context menu and can expose more menu items in the same space than a traditional menu control.</p>\n<p>\n</p><h2>Hub Tile</h2>\n<p>HubTile is a ContentControl that makes it possible to display live tiles within your application user interface. Content updates are shown through a variety of smooth animations similar to the live tile updates shown on the start screen of Windows 8.</p>\n<p>\n</p><p>And several more controls like Editors, Tab Control, Tile View, Cover flow etc are available in this toolkit.</p>\n\t\t\t"}